{
    "experiences": [
      {
        "title": "Intern",
        "subtitle": "ZeroZilla",
        "workType": "MediCodio Project",
        "workDescription": [
          "Led optimization strategies with RF engineers across Central Region states, enhancing drive data collection processes and achieving superior data accuracy and reliability.",
          "Orchestrated a complex vendor and sub-vendor network, directly overseeing a primary vendor with 4 sub-vendors and a team of 150+ drive testers, ensuring high operational efficiency and quality control. Designed and implemented comprehensive drive process plans for the Central Region, integrating equipment checks, site alarm monitoring, and drive monitoring tools to support informed go/no-go decisions for drive tests.",
          "Fostered collaboration with market teams across Central Region states to identify and rectify non-conforming grids in data clusters, establishing detailed protocols for root cause analysis (utility checks, ducting, backhaul assessments) on drive days.",
          "Initiated real-time troubleshooting protocols during drive tests to swiftly address signal strength, interference, and system performance issues, significantly reducing data collection downtime.",
          "Developed and enforced vendor performance Trackers, centralizing vendor records to efficiently track and manage vendor reliability, quality, and compliance, thereby minimizing operational risks.",
          "Conducted comprehensive vendor onboarding and training sessions, ensuring all suppliers were proficient in company tools and processes, leading to enhanced service delivery and stakeholder satisfaction in the Central Region."
        ],
        "dateText": "April 2024 to Present"
      },
      {
        "title": "KYC-ICICI",
        "subtitle": "ProData",
        "workType": "Ipru-Team",
        "workDescription": [
          "Managing multiple site acquisition vendor relationships and contracts in driving consistency, efficiency, and financial results.",
          "Ensure management and internal/external customers are aware of issues that will impact project completion.",
          "Run regular development meetings with cross-functional teams and Hard Cost vendors. Ensure that power deliveries are synchronized with construction activities.",
          "Ensure permits are closed out correctly.",
          "Influencing stakeholders to align on program objectives and goals and not just functional area responsibilities."
        ],
        "dateText": "Sep 2023 to April 2024"
      },
      {
        "title": "Back-End-Intern",
        "subtitle": "Tranto",
        "workType": "Development",
        "workDescription": [
          "Verifying if the Hard cost vendor GC’s work is in accordance with the Construction Designs provided and maintaining safety practices.",
          "Ensure that power deliveries are synchronized with construction activities.",
          "Coach and developed over 100’s of direct reports.",
          "Interface with the site and project management teams to ensure timely delivery of sites.",
          "Report project status and performance data to management.",
          "Ensure permits are closed out correctly.",
          "Supervised daily activities of several Field Technicians by assigning workloads, resource planning, etc. to achieve Network Trouble management."
        ],
        "dateText": "Nov 2022 to May 2023"
      }
    ]
  }
  