{
    "projects": [
      {
        
        "title": "Build and Deploy a Simple Cricket App",
        "bodyText": "- Built a simple Cricket application using front-end technologies like HTML, CSS, and JavaScript.\n- Packaged the application using Docker, a popular platform for developing, shipping, and running applications.\n- Deployed the application using Kubernetes, an open-source platform for automating deployment, scaling, and management of containerized applications.\n- Managed the application using OpenShift, a family of containerization software developed by Red Hat.",
        "links": [
          {
            "text": "GitHub",
            "href": "https://github.com/ManokaranAnbazhagan26/KMR-Cricket-site"
          }
        ],
        "tags": ["React-Vite","TailWind"]
      },
      {
        
        "title": "Deploy Booking App ",
        "bodyText": "- Deployed the Booking application from the OpenShift Internal Registry, a built-in container image registry that is deployed by default with OpenShift.\n- Managed the application lifecycle, including updates and rollbacks, using OpenShift’s built-in features.\n- Ensured the application is scalable and can handle requests efficiently.",
        "links": [
          {
            "text": "GitHub",
            "href": "https://github.com/ManokaranAnbazhagan26/React_Booking_App"
          }
        ],
        "tags": ["React-vite", "bootstrap","react-router-dom"]
      },
      {
        
        "title": "Social App",
        "bodyText": "- Designed and architected a full-stack application using microservices.\n- Developed both front-end and back-end components of the application using technologies such as HTML, CSS, JavaScript, and React.\n- Implemented user management and authentication mechanisms to secure the application.\n- Developed backend services and established communication with databases.\n- Utilized CI/CD pipelines for continuous integration and deployment of changes.\n- Deployed serverless applications on Code Engine.\n- Created and invoked RESTful microservices.\n- Deployed the entire solution on the cloud using Kubernetes.",
        "links": [
          {
            "text": "GitHub",
            "href": "https://github.com/ManokaranAnbazhagan26/react_social_app_netlify"
          }
        ],
        "tags": [ "HTML", "CSS", "JavaScript", "React-vite","react-router" ]
      }
    ]
  }
  